In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://retail_user:retail_password@localhost:5432/retail_db

env: DATABASE_URL=postgresql://retail_user:retail_password@localhost:5432/retail_db

In [5]:
%%sql

SELECT order_date, count(1) AS order_count
FROM orders
WHERE order_status IN ('COMPLETE', 'CLOSED')
GROUP BY order_date
HAVING count(1) > 50
ORDER BY order_count DESC
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(datetime.datetime(2013, 11, 3, 0, 0), 146),
 (datetime.datetime(2013, 10, 4, 0, 0), 127),
 (datetime.datetime(2013, 9, 14, 0, 0), 126),
 (datetime.datetime(2013, 11, 5, 0, 0), 126),
 (datetime.datetime(2013, 11, 14, 0, 0), 125),
 (datetime.datetime(2013, 11, 11, 0, 0), 125),
 (datetime.datetime(2013, 11, 30, 0, 0), 125),
 (datetime.datetime(2014, 6, 19, 0, 0), 124),
 (datetime.datetime(2014, 5, 6, 0, 0), 123),
 (datetime.datetime(2014, 4, 21, 0, 0), 123)]

In [6]:
%%sql

SELECT * FROM orders
ORDER BY order_customer_id
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(22945, datetime.datetime(2013, 12, 13, 0, 0), 1, 'COMPLETE'),
 (33865, datetime.datetime(2014, 2, 18, 0, 0), 2, 'COMPLETE'),
 (67863, datetime.datetime(2013, 11, 30, 0, 0), 2, 'COMPLETE'),
 (15192, datetime.datetime(2013, 10, 29, 0, 0), 2, 'PENDING_PAYMENT'),
 (57963, datetime.datetime(2013, 8, 2, 0, 0), 2, 'ON_HOLD'),
 (56178, datetime.datetime(2014, 7, 15, 0, 0), 3, 'PENDING'),
 (57617, datetime.datetime(2014, 7, 24, 0, 0), 3, 'COMPLETE'),
 (23662, datetime.datetime(2013, 12, 19, 0, 0), 3, 'COMPLETE'),
 (22646, datetime.datetime(2013, 12, 11, 0, 0), 3, 'COMPLETE'),
 (35158, datetime.datetime(2014, 2, 26, 0, 0), 3, 'COMPLETE')]

In [8]:
%%sql

SELECT * FROM orders
ORDER BY order_customer_id ASC
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(22945, datetime.datetime(2013, 12, 13, 0, 0), 1, 'COMPLETE'),
 (33865, datetime.datetime(2014, 2, 18, 0, 0), 2, 'COMPLETE'),
 (67863, datetime.datetime(2013, 11, 30, 0, 0), 2, 'COMPLETE'),
 (15192, datetime.datetime(2013, 10, 29, 0, 0), 2, 'PENDING_PAYMENT'),
 (57963, datetime.datetime(2013, 8, 2, 0, 0), 2, 'ON_HOLD'),
 (56178, datetime.datetime(2014, 7, 15, 0, 0), 3, 'PENDING'),
 (57617, datetime.datetime(2014, 7, 24, 0, 0), 3, 'COMPLETE'),
 (23662, datetime.datetime(2013, 12, 19, 0, 0), 3, 'COMPLETE'),
 (22646, datetime.datetime(2013, 12, 11, 0, 0), 3, 'COMPLETE'),
 (35158, datetime.datetime(2014, 2, 26, 0, 0), 3, 'COMPLETE')]

In [9]:
%%sql

SELECT * FROM orders
ORDER BY order_customer_id,
    order_date
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(22945, datetime.datetime(2013, 12, 13, 0, 0), 1, 'COMPLETE'),
 (57963, datetime.datetime(2013, 8, 2, 0, 0), 2, 'ON_HOLD'),
 (15192, datetime.datetime(2013, 10, 29, 0, 0), 2, 'PENDING_PAYMENT'),
 (67863, datetime.datetime(2013, 11, 30, 0, 0), 2, 'COMPLETE'),
 (33865, datetime.datetime(2014, 2, 18, 0, 0), 2, 'COMPLETE'),
 (22646, datetime.datetime(2013, 12, 11, 0, 0), 3, 'COMPLETE'),
 (61453, datetime.datetime(2013, 12, 14, 0, 0), 3, 'COMPLETE'),
 (23662, datetime.datetime(2013, 12, 19, 0, 0), 3, 'COMPLETE'),
 (35158, datetime.datetime(2014, 2, 26, 0, 0), 3, 'COMPLETE'),
 (46399, datetime.datetime(2014, 5, 9, 0, 0), 3, 'PROCESSING')]

In [10]:
%%sql

SELECT * FROM orders
ORDER BY order_customer_id,
    order_date DESC
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(22945, datetime.datetime(2013, 12, 13, 0, 0), 1, 'COMPLETE'),
 (33865, datetime.datetime(2014, 2, 18, 0, 0), 2, 'COMPLETE'),
 (67863, datetime.datetime(2013, 11, 30, 0, 0), 2, 'COMPLETE'),
 (15192, datetime.datetime(2013, 10, 29, 0, 0), 2, 'PENDING_PAYMENT'),
 (57963, datetime.datetime(2013, 8, 2, 0, 0), 2, 'ON_HOLD'),
 (57617, datetime.datetime(2014, 7, 24, 0, 0), 3, 'COMPLETE'),
 (56178, datetime.datetime(2014, 7, 15, 0, 0), 3, 'PENDING'),
 (46399, datetime.datetime(2014, 5, 9, 0, 0), 3, 'PROCESSING'),
 (35158, datetime.datetime(2014, 2, 26, 0, 0), 3, 'COMPLETE'),
 (23662, datetime.datetime(2013, 12, 19, 0, 0), 3, 'COMPLETE')]

In [11]:
%%sql

SELECT o.order_date,
    oi.order_item_product_id,
    round(sum(oi.order_item_subtotal::numeric), 2) AS revenue
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date,
    oi.order_item_product_id
ORDER BY o.order_date,
    revenue DESC
LIMIT 25

 * postgresql://retail_user:***@localhost:5432/retail_db
25 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('319.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 821, Decimal('207.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 625, Decimal('199.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 705, Decimal('119.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 572, Decimal('119.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 666, Decimal('109.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 725, Decimal('108.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 134, Decimal('100.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 906, Decimal('99.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 828, Decimal('95.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 810, Decimal('79.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 924, Decimal('79.95')),
 (datetime.datetime(2013, 7, 25, 0, 0), 926, Decimal('79.95')),
 (datetime.datetime(2013, 7, 25, 0, 0), 93, Decimal('74.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 835, Decimal('63.98'))]

In [12]:
%%sql

SELECT o.order_date,
    oi.order_item_product_id,
    round(sum(oi.order_item_subtotal::numeric), 2) AS revenue
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date,
    oi.order_item_product_id
HAVING round(sum(oi.order_item_subtotal::numeric), 2) >= 1000
ORDER BY o.order_date,
    revenue DESC
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73')),
 (datetime.datetime(2013, 7, 26, 0, 0), 1004, Decimal('10799.46'))]

In [13]:
%%sql

DROP TABLE IF EXISTS users

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [14]:
%%sql

CREATE TABLE users (
    user_id SERIAL PRIMARY KEY,
    user_first_name VARCHAR(30) NOT NULL,
    user_last_name VARCHAR(30) NOT NULL,
    user_email_id VARCHAR(50) NOT NULL,
    user_email_validated BOOLEAN DEFAULT FALSE,
    user_password VARCHAR(200),
    user_role VARCHAR(1) NOT NULL DEFAULT 'U', --U and A
    user_country VARCHAR(2),
    is_active BOOLEAN DEFAULT FALSE,
    create_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    last_updated_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [15]:
%%sql

INSERT INTO users (user_first_name, user_last_name, user_email_id, user_country)
VALUES ('Donald', 'Duck', 'donald@duck.com', 'IN')

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[]

In [16]:
%%sql

INSERT INTO users (user_first_name, user_last_name, user_email_id, user_role, is_active, user_country)
VALUES ('Mickey', 'Mouse', 'mickey@mouse.com', 'U', true, 'US')

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[]

In [17]:
%%sql

INSERT INTO users 
    (user_first_name, user_last_name, user_email_id, user_password, user_role, is_active, user_country) 
VALUES 
    ('Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'h9LAz7p7ub', 'U', true, 'CA'),
    ('Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'oEofndp', 'U', true, 'FR'),
    ('Addie', 'Mesias', 'amesias2@twitpic.com', 'ih7Y69u56', 'U', true, 'AU')

 * postgresql://retail_user:***@localhost:5432/retail_db
3 rows affected.

[]

In [18]:
%%sql

SELECT * FROM users
ORDER BY user_country

 * postgresql://retail_user:***@localhost:5432/retail_db
5 rows affected.

[(5, 'Addie', 'Mesias', 'amesias2@twitpic.com', False, 'ih7Y69u56', 'U', 'AU', True, datetime.datetime(2021, 12, 9, 3, 31, 55, 88702), datetime.datetime(2021, 12, 9, 3, 31, 55, 88702)),
 (3, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', False, 'h9LAz7p7ub', 'U', 'CA', True, datetime.datetime(2021, 12, 9, 3, 31, 55, 88702), datetime.datetime(2021, 12, 9, 3, 31, 55, 88702)),
 (4, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', False, 'oEofndp', 'U', 'FR', True, datetime.datetime(2021, 12, 9, 3, 31, 55, 88702), datetime.datetime(2021, 12, 9, 3, 31, 55, 88702)),
 (1, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', 'IN', False, datetime.datetime(2021, 12, 9, 3, 31, 53, 849348), datetime.datetime(2021, 12, 9, 3, 31, 53, 849348)),
 (2, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', 'US', True, datetime.datetime(2021, 12, 9, 3, 31, 54, 569313), datetime.datetime(2021, 12, 9, 3, 31, 54, 569313))]

In [19]:
%%sql

SELECT user_id,
    user_first_name,
    user_last_name,
    user_email_id,
    user_country
FROM users
ORDER BY 
    CASE WHEN user_country = 'US' THEN 0
        ELSE 1
    END, user_country

 * postgresql://retail_user:***@localhost:5432/retail_db
5 rows affected.

[(2, 'Mickey', 'Mouse', 'mickey@mouse.com', 'US'),
 (5, 'Addie', 'Mesias', 'amesias2@twitpic.com', 'AU'),
 (3, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'CA'),
 (4, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'FR'),
 (1, 'Donald', 'Duck', 'donald@duck.com', 'IN')]